'''
Константы и необходимые для расчетов.
'''

PRODUCT_MASS: list = ['30', '25', '20', '18', '14', '10', '9', '7', '5', '2', '1']

TELEPHONE_NUMBER_VALID_SYMBOLS: list = ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '(', ')', '-', '+', ' ']

DUMMY_BONUS_PER_TON: int = 200

COUNT_KGS_IN_TON: int = 1000

BUGS_COUNT_IN_PALETTE: dict = {'1': 384, '2': 128, '5': 108, '7': 72, '9': 44,
                               '10': 60, '14': 44, '18': 56, '20': 64, '25': 56,
                               '30': 49}