'''
Модуль контектов ошибок для экрана notice.
'''

UNIQUE_EXTERNAL_ID_ERROR = ': дистрибьютор с таким внешним ID уже существует в базе под именем:'

CHANGE_DISTRIBUTOR_ID_ERROR = ': ошибка при попытке получить ID дистрибьютора из формы, ID не был передан!'

CHANGE_DISTRIBUTOR_SAVE_ERROR = ': ошибка сохранения измененых данных дистрибьютора, убедидетесь, что не оставили пустых полей!'

PRODUCT_MASS_ERROR = ': ошибка получения массы продукта, нет соответсвия стандартным значениям'

SALES_UNITS_ERROR = ': ошибка выбора "Единицы продажи", для формата отчета "Кабинет 007" доступно только "Тонны", вы выбрали "Мешки"!'